DataProcessors/лб_ЭлектроннаяВыгрузкаВРСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>лб_ЭлектроннаяВыгрузкаВРСО</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЗначениеСвойствОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначениеСвойствОбъектовУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_СвойстваОбъектовУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/лб_ЭлектроннаяВыгрузкаВРСО/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	ЗаполнитьУчастки();
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_АдминистративныеОкруга.Ссылка КАК Участок
	|ИЗ
	|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
	|ГДЕ
	|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоАдресуПриИзменении(Элемент)	
	
	Если ПоАдресу Тогда
		Элементы.ГруппаУточнениеАдреса.Доступность = Истина;	
	Иначе
		Элементы.ГруппаУточнениеАдреса.Доступность = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайл(Команда)
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Сообщить("Не заполнен каталог!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФорматФайла) Тогда
		Сообщить("Не заполнен формат файла!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Сообщить("Не заполнен период!");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеНаСервере();
	Если Не ТаблицаИтог.Количество() = 0 Тогда
		СформироватьФайлНаКлиенте();	
	Иначе	
		Сообщить("Не найдены данные для сохранения в файл!");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	
	ТаблицаИтог.Очистить();
	
	МассивУчастков = ПолучитьМассивУчастков();
	МассивАдресов = ПолучитьМассивАдресов();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент", Период.ДатаОкончания);
	//Запрос.УстановитьПараметр("ЛицевойСчет", Справочники.бит_ЛицевыеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ceaf245c-1d93-11e9-ba8d-ac1f6b0f1d47")));//76141061835 (Справочник.бит_ЛицевыеСчета)
	Запрос.УстановитьПараметр("ДокументВид", Справочники.бит_ДокументыУдостоверяющиеЛичность.ПолучитьСсылку(Новый УникальныйИдентификатор("d0e846ea-daa6-11e9-ba98-ac1f6b0f1d47")));//Паспорт РФ  (Справочник.бит_ДокументыУдостоверяющиеЛичность)
	
	Если ЗначениеЗаполнено(ПоставщикГазоснабжения) Тогда
		
		ЗапросПоставщикГазоснабжения = "
		|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.ПоставщикГазоснабжения = &ПоставщикГазоснабжения";
		
		Запрос.УстановитьПараметр("ПоставщикГазоснабжения", ПоставщикГазоснабжения);
		
	Иначе
		ЗапросПоставщикГазоснабжения = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоставщикТеплоснабжения) Тогда
		
		ЗапросПоставщикТеплоснабжения = "
		|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.ПоставщикТеплоснабжения = &ПоставщикТеплоснабжения";
		
		Запрос.УстановитьПараметр("ПоставщикТеплоснабжения", ПоставщикТеплоснабжения);
	Иначе
		ЗапросПоставщикТеплоснабжения = "";
	КонецЕсли;
	
	Если ГрузитьТолькоИзменения Тогда
		
		ЗапросГрузитьТолькоИзменения =  "
		|	И ПроживающиеПоЛССрезПоследних.Регистратор.Дата МЕЖДУ &НачПериода И &КонПериода
		|	И ТИПЗНАЧЕНИЯ(ПроживающиеПоЛССрезПоследних.Регистратор) = ТИП(Документ.бит_РегистрацияПроживающихПоЛС)";
		
		Запрос.УстановитьПараметр("НачПериода", Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонПериода", Период.ДатаОкончания);
	Иначе
		ЗапросГрузитьТолькоИзменения = "";
	КонецЕсли;
	
	Если МассивУчастков.Количество() > 0 Тогда
		ЗапросУчастки = "  
		|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.Район В(&СписокУчастков)";
		
		Запрос.УстановитьПараметр("СписокУчастков", МассивУчастков);
	Иначе
		ЗапросУчастки = "";
	КонецЕсли; 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.Период КАК Период,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены КАК ДокументПричинаЗамены
	               |ПОМЕСТИТЬ вт_ПаспортныеДанные
	               |ИЗ
	               |	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	               |ГДЕ
	               |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид = &ДокументВид
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования)
	               |				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбщаяПлощадьМестОбщегоПользования,
	               |	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета КАК ОбъектУчета
	               |ПОМЕСТИТЬ вт_ОбщаяПлощадьМестОбщегоПользования
	               |ИЗ
	               |	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	               |ГДЕ
	               |	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	               |				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбщаяПлощадьЖилогоЗдания,
	               |	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета КАК ОбъектУчета
	               |ПОМЕСТИТЬ вт_ОбщаяПлощадьЖилогоЗдания
	               |ИЗ
	               |	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	               |ГДЕ
	               |	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	               |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	               |ПОМЕСТИТЬ вт_ОбщаяПлощадьПоПомещению
	               |ИЗ
	               |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ЛицевыеСчета.Ссылка) КАК КоличествоЛицевых,
	               |	бит_ЛицевыеСчета.Здание КАК Здание,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК КвартираНомерКвартиры
	               |ПОМЕСТИТЬ ВТ_КоличествоЛицевыхПоРазделенным
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	               |		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	               |ГДЕ
	               |	бит_ЛицевыеСчета.Квартира В
	               |			(ВЫБРАТЬ
	               |				вт_ОбщаяПлощадьПоПомещению.Квартира КАК Квартира
	               |			ИЗ
	               |				вт_ОбщаяПлощадьПоПомещению КАК вт_ОбщаяПлощадьПоПомещению)
	               |	И НЕ бит_ЛицевыеСчета.Архивный
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ЛицевыеСчета.Здание,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроживающиеПоЛССрезПоследних.Период КАК Период,
	               |	ПроживающиеПоЛССрезПоследних.Регистратор КАК Регистратор,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	               |	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФИО,
	               |	ПроживающиеПоЛССрезПоследних.лб_ДатаРегистрацииДляФЛС КАК IN_DATE,
	               |	ПроживающиеПоЛССрезПоследних.лб_ДатаВыпискиДляФЛС КАК OUT_DATE,
	               |	ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	               |	ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	               |	РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
	               |		КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
	               |			ТОГДА 1
	               |		КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
	               |				И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Возраст,
	               |	ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол КАК ФизЛицоПол,
	               |	вт_ПаспортныеДанные.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	вт_ПаспортныеДанные.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание КАК ЛицевойСчетЗдание,
	               |	ПроживающиеПоЛССрезПоследних.ФизЛицо.ТелефонПроживающего КАК TEL,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.ЕЛСГИСЖКХ КАК C_SAN,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета.КодУлицы КАК KOD_KLADR,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.КодФИАС КАК FIAS,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК NYLIC,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.НомерДома КАК NDOM,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.ПрефиксДома КАК LDOM,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира.НомерКвартиры КАК NKW,
	               |	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира.ПрефиксКвартиры КАК LKW,
	               |	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК KSS,
	               |	ЕСТЬNULL(лб_Тест_Дома.PL_MOP, вт_ОбщаяПлощадьМестОбщегоПользования.ОбщаяПлощадьМестОбщегоПользования) КАК Пл_МОП,
	               |	вт_ОбщаяПлощадьПоПомещению.ОбщаяПлощадь КАК Пл_МОП_1,
	               |	вт_ПаспортныеДанные.ДокументВид КАК V_DOK,
	               |	вт_ПаспортныеДанные.ДокументСерия КАК S_DOK,
	               |	вт_ПаспортныеДанные.ДокументНомер КАК N_DOK,
	               |	вт_ПаспортныеДанные.ДокументДатаВыдачи КАК D_DOK,
	               |	вт_ПаспортныеДанные.ДокументКемВыдан КАК KEM_V,
	               |	вт_ОбщаяПлощадьЖилогоЗдания.ОбщаяПлощадьЖилогоЗдания КАК ROPL,
	               |	ВТ_КоличествоЛицевыхПоРазделенным.КоличествоЛицевых КАК KCHLS
	               |ИЗ
	               |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК ПроживающиеПоЛССрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПаспортныеДанные КАК вт_ПаспортныеДанные
	               |		ПО ПроживающиеПоЛССрезПоследних.ФизЛицо = вт_ПаспортныеДанные.ФизЛицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОбщаяПлощадьМестОбщегоПользования КАК вт_ОбщаяПлощадьМестОбщегоПользования
	               |		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание = вт_ОбщаяПлощадьМестОбщегоПользования.ОбъектУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОбщаяПлощадьПоПомещению КАК вт_ОбщаяПлощадьПоПомещению
	               |		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира = вт_ОбщаяПлощадьПоПомещению.Квартира
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОбщаяПлощадьЖилогоЗдания КАК вт_ОбщаяПлощадьЖилогоЗдания
	               |		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание = вт_ОбщаяПлощадьЖилогоЗдания.ОбъектУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	               |		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание = лб_Тест_Дома.Здание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	               |		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира = бит_Квартиры.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	               |		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоЛицевыхПоРазделенным КАК ВТ_КоличествоЛицевыхПоРазделенным
	               |		ПО (бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = ВТ_КоличествоЛицевыхПоРазделенным.КвартираНомерКвартиры)
	               |			И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание = ВТ_КоличествоЛицевыхПоРазделенным.Здание
	               |ГДЕ
	               |	1 = 1" + ЗапросУчастки + ЗапросПоставщикТеплоснабжения + ЗапросПоставщикГазоснабжения + ЗапросГрузитьТолькоИзменения +  
	"";
	
	Если Не МассивАдресов.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание В (&Адреса)");	
		Запрос.УстановитьПараметр("Адреса", МассивАдресов);	
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрокаИтоговойТаблицы = ТаблицаИтог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, ВыборкаДетальныеЗаписи);
		
		НоваяСтрокаИтоговойТаблицы.DROG = "" + Формат(ВыборкаДетальныеЗаписи.ДатаРождения, "ДФ=гггг") +  Формат(ВыборкаДетальныеЗаписи.ДатаРождения, "ДФ=ММ") + Формат(ВыборкаДетальныеЗаписи.ДатаРождения, "ДФ=дд");
		НоваяСтрокаИтоговойТаблицы.IN_DATE = "" + Формат(ВыборкаДетальныеЗаписи.IN_DATE, "ДФ=гггг") +  Формат(ВыборкаДетальныеЗаписи.IN_DATE, "ДФ=ММ") + Формат(ВыборкаДетальныеЗаписи.IN_DATE, "ДФ=дд");
		OUT_DATE = СтрокаВДату(ВыборкаДетальныеЗаписи.OUT_DATE);
		НоваяСтрокаИтоговойТаблицы.OUT_DATE = "" + Формат(OUT_DATE, "ДФ=гггг") +  Формат(OUT_DATE, "ДФ=ММ") + Формат(OUT_DATE, "ДФ=дд");
		
		НоваяСтрокаИтоговойТаблицы.IND = Лев(ВыборкаДетальныеЗаписи.ЛицевойСчет,  4);
		НоваяСтрокаИтоговойТаблицы.LIC = Прав(ВыборкаДетальныеЗаписи.ЛицевойСчет, 7);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.D_DOK) Тогда
			НоваяСтрокаИтоговойТаблицы.D_DOK = Формат(ВыборкаДетальныеЗаписи.D_DOK, "ДЛФ=Д");	
		КонецЕсли; 
		
		Попытка
			ФамилияИмяОтчество = ЧастиИмени(ВыборкаДетальныеЗаписи.ФИО.Наименование);
			
			НоваяСтрокаИтоговойТаблицы.FAMIL = ФамилияИмяОтчество.Фамилия;
			НоваяСтрокаИтоговойТаблицы.IMJA = ФамилияИмяОтчество.Имя;
			НоваяСтрокаИтоговойТаблицы.OTCH = ФамилияИмяОтчество.Отчество;
			
		Исключение
			ФИО = "";
		КонецПопытки;
		
		//НоваяСтрокаИтоговойТаблицы.ROPL = ВыборкаДетальныеЗаписи.ROPL;
		НоваяСтрокаИтоговойТаблицы.ROPL = ВыборкаДетальныеЗаписи.Пл_МОП_1;
		
		НоваяСтрокаИтоговойТаблицы.NKW = "" + ВыборкаДетальныеЗаписи.NKW + ВыборкаДетальныеЗаписи.LKW; 		
		НоваяСтрокаИтоговойТаблицы.LKW = "";
		
		ПравоустанавливающиеДокументы = ПолучитьПравоустанавливающиеДокументы(ВыборкаДетальныеЗаписи.ФИО, ВыборкаДетальныеЗаписи.ЛицевойСчет);
		НоваяСтрокаИтоговойТаблицы.ДокументыНаКвартиру = ПравоустанавливающиеДокументы;
		
		//НоваяСтрокаИтоговойТаблицы.KSOB = МассивСобственников(ВыборкаДетальныеЗаписи.ЛицевойСчет);
		
		Если ВыборкаДетальныеЗаписи.KSS = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			НоваяСтрокаИтоговойТаблицы.OKS = "1";
		Иначе 
			НоваяСтрокаИтоговойТаблицы.OKS = "0";
		КонецЕсли; 
		
		Если ПроверитьСобственника(ВыборкаДетальныеЗаписи.ФИО, ВыборкаДетальныеЗаписи.ЛицевойСчет) Тогда
			НоваяСтрокаИтоговойТаблицы.KSOB = МассивСобственников(ВыборкаДетальныеЗаписи.ЛицевойСчет);	
		Иначе
			НоваяСтрокаИтоговойТаблицы.KSOB = "";
		КонецЕсли; 
		
		//НоваяСтрокаИтоговойТаблицы.KSS = "";
		Если ПроверитьСобственника(ВыборкаДетальныеЗаписи.ФИО, ВыборкаДетальныеЗаписи.ЛицевойСчет) Тогда
			ДоляПроживающего = ПолучитьДолюПроживающего(ВыборкаДетальныеЗаписи.ФИО, ВыборкаДетальныеЗаписи.ЛицевойСчет);		
			Если НоваяСтрокаИтоговойТаблицы.OKS = "1" Тогда
				Если ДоляПроживающего = 1 Тогда
					НоваяСтрокаИтоговойТаблицы.KSS = "" + "собственник";
				ИначеЕсли ДоляПроживающего > 0 Тогда 
					ДоляПроживающегоЛитера = ПолучитьДолюПроживающегоЛитера(ВыборкаДетальныеЗаписи.ФИО, ВыборкаДетальныеЗаписи.ЛицевойСчет);
					Если СтрНайти(ДоляПроживающегоЛитера, "с") > 0 ИЛИ Найти(ДоляПроживающегоЛитера, "0") > 0 Тогда
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "о", "");
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "с", "");
						
						НоваяСтрокаИтоговойТаблицы.KSS = "" + "совм.собс-ть " + ДоляПроживающегоЛитера_Вывод;
					Иначе						
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "о", "");
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "с", "");
						
						НоваяСтрокаИтоговойТаблицы.KSS = "" + ДоляПроживающегоЛитера_Вывод;
					КонецЕсли; 	
				Иначе				
				КонецЕсли; 
			Иначе
				Если ДоляПроживающего = 1 Тогда
					НоваяСтрокаИтоговойТаблицы.KSS = "" + "собственник " +  "-" + ВыборкаДетальныеЗаписи.KSS;
				ИначеЕсли ДоляПроживающего > 0 Тогда 
					ДоляПроживающегоЛитера = ПолучитьДолюПроживающегоЛитера(ВыборкаДетальныеЗаписи.ФИО, ВыборкаДетальныеЗаписи.ЛицевойСчет);
					Если СтрНайти(ДоляПроживающегоЛитера, "с") > 0 ИЛИ Найти(ДоляПроживающегоЛитера, "0") > 0 Тогда
						
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "о", "");
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "с", "");
						
						НоваяСтрокаИтоговойТаблицы.KSS = "" + "совм.собс-ть " + ДоляПроживающегоЛитера_Вывод+  "-" + ВыборкаДетальныеЗаписи.KSS;
					Иначе
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "о", "");
						ДоляПроживающегоЛитера_Вывод = СтрЗаменить(ДоляПроживающегоЛитера, "с", "");
						
						НоваяСтрокаИтоговойТаблицы.KSS = "" + "собственник " + ДоляПроживающегоЛитера_Вывод + "-" + ВыборкаДетальныеЗаписи.KSS;
					КонецЕсли; 
				Иначе
				КонецЕсли; 
			КонецЕсли; 	
		КонецЕсли; 
		
		//Проверим паспортные данные 
		Если НЕ ЗначениеЗаполнено(НоваяСтрокаИтоговойТаблицы.V_DOK) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрокаИтоговойТаблицы.S_DOK) Тогда
			
			ПолучитьПаспортныеДанные(ВыборкаДетальныеЗаписи.ФИО, НоваяСтрокаИтоговойТаблицы);
			
			Если ЗначениеЗаполнено(НоваяСтрокаИтоговойТаблицы.D_DOK) Тогда
				НоваяСтрокаИтоговойТаблицы.D_DOK = Формат(НоваяСтрокаИтоговойТаблицы.D_DOK, "ДЛФ=Д");	
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПаспортныеДанные(ФизЛицо, НоваяСтрокаИтоговойТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	//Параметр "ДокументВид" (Список значений)
	Параметр = Новый СписокЗначений;
	Параметр.Добавить(Справочники.бит_ДокументыУдостоверяющиеЛичность.ИМНС21);
	Параметр.Добавить(Справочники.бит_ДокументыУдостоверяющиеЛичность.ПолучитьСсылку(Новый УникальныйИдентификатор("d0e846ea-daa6-11e9-ba98-ac1f6b0f1d47")));// Паспорт РФ (Справочник.бит_ДокументыУдостоверяющиеЛичность)
	Запрос.УстановитьПараметр("ДокументВид", Параметр);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПаспортныеДанныеПроживающих.Период КАК Период,
	|	бит_ПаспортныеДанныеПроживающих.ФизЛицо КАК ФизЛицо,
	|	бит_ПаспортныеДанныеПроживающих.ДокументВид КАК V_DOK,
	|	бит_ПаспортныеДанныеПроживающих.ДокументСерия КАК S_DOK,
	|	бит_ПаспортныеДанныеПроживающих.ДокументНомер КАК N_DOK,
	|	бит_ПаспортныеДанныеПроживающих.ДокументДатаВыдачи КАК D_DOK,
	|	бит_ПаспортныеДанныеПроживающих.ДокументКемВыдан КАК KEM_V,
	|	бит_ПаспортныеДанныеПроживающих.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающих.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающих.ДокументПричинаЗамены КАК ДокументПричинаЗамены
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих КАК бит_ПаспортныеДанныеПроживающих
	|ГДЕ
	|	бит_ПаспортныеДанныеПроживающих.ФизЛицо = &ФизЛицо
	|	И бит_ПаспортныеДанныеПроживающих.ДокументВид В (&ДокументВид)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, Выборка);	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДолюПроживающегоЛитера(ФизЛицо, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ЛС", ЛицевойСчет); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			,
	|			ЛицевойСчет = &ЛС                 И
	|			ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.лб_ДоляПлощадиСтрокой;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ПолучитьДолюПроживающего(ФизЛицо, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ЛС", ЛицевойСчет); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			,
	|			ЛицевойСчет = &ЛС                 И
	|			ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.ДоляПлощади;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ПроверитьСобственника(ФизЛицо, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ЛС", ЛицевойСчет); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			,
	|			ЛицевойСчет = &ЛС                 И
	|			ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция МассивСобственников(Лс)
	
	МассивСобственников = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ЛицевойСчет = &ЛС) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади > 0";
	
	Запрос.УстановитьПараметр("ЛС", ЛС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивСобственников = РезультатЗапроса.Выгрузить();
	Возврат МассивСобственников.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьПравоустанавливающиеДокументы(Проживающий, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("бит_ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("бит_Проживающий", Проживающий);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.Ссылка КАК Ссылка,
	|	бит_ПравоустанавливающиеДокументы.ВерсияДанных КАК ВерсияДанных,
	|	бит_ПравоустанавливающиеДокументы.ПометкаУдаления КАК ПометкаУдаления,
	|	бит_ПравоустанавливающиеДокументы.Код КАК Код,
	|	бит_ПравоустанавливающиеДокументы.Наименование КАК Наименование,
	|	бит_ПравоустанавливающиеДокументы.НомерДокумента КАК НомерДокумента,
	|	бит_ПравоустанавливающиеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	бит_ПравоустанавливающиеДокументы.ОрганизацияВыдавшаяДокумент КАК ОрганизацияВыдавшаяДокумент,
	|	бит_ПравоустанавливающиеДокументы.ВидДокумента КАК ВидДокумента,
	|	бит_ПравоустанавливающиеДокументы.лб_Архив КАК лб_Архив,
	|	бит_ПравоустанавливающиеДокументы.лб_ИспользоватьАрхивДляФЛС КАК лб_ИспользоватьАрхивДляФЛС,
	|	бит_ПравоустанавливающиеДокументы.лб_НомерЛС10 КАК лб_НомерЛС10,
	|	бит_ПравоустанавливающиеДокументы.бит_Проживающий КАК бит_Проживающий,
	|	бит_ПравоустанавливающиеДокументы.бит_ЛицевойСчет КАК бит_ЛицевойСчет,
	|	бит_ПравоустанавливающиеДокументы.бит_Архивный КАК бит_Архивный,
	|	бит_ПравоустанавливающиеДокументы.бит_ДатаВнесенияДокументов КАК бит_ДатаВнесенияДокументов,
	|	бит_ПравоустанавливающиеДокументы.Предопределенный КАК Предопределенный,
	|	бит_ПравоустанавливающиеДокументы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	бит_ПравоустанавливающиеДокументы.Представление КАК Представление
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.бит_ЛицевойСчет = &бит_ЛицевойСчет
	|	И бит_ПравоустанавливающиеДокументы.бит_Архивный = ЛОЖЬ
	|	И бит_ПравоустанавливающиеДокументы.бит_Проживающий = &бит_Проживающий";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		стрДокументы = "";
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.НомерДокумента) ИЛИ ЗначениеЗаполнено(Выборка.ДатаДокумента) Тогда
				стрДокументы = "" + стрДокументы + Выборка.Наименование + " " + Выборка.НомерДокумента + " от " + Формат(Выборка.ДатаДокумента, "ДЛФ=Д") + " г." + "; ";
			Иначе
				стрДокументы = "" + стрДокументы + Выборка.Представление + "; ";	
			КонецЕсли; 			
		КонецЦикла; 
		Возврат стрДокументы;
	Иначе
		Возврат "";
		
	КонецЕсли;  
	
КонецФункции

&НаКлиенте
Процедура СформироватьФайлНаКлиенте()
	
	Если ФорматФайла = "csv" Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + " " + Формат(ТекущаяДата(),"ДЛФ=Д") + ".csv";
		ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".csv";
		АдресНаСервере = СформироватьCSVФайлНаКлиенте(ПолноеИмяФайла, ИмяВременногоФайла);
	ИначеЕсли ФорматФайла = "dbf" Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + Формат(ТекущаяДата(),"ДЛФ=Д") + ".dbf";
		ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".dbf";
		АдресНаСервере = СформироватьDBFФайлНаКлиенте(ПолноеИмяФайла, ИмяВременногоФайла);
	ИначеЕсли ФорматФайла = "xlsx" Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + " " + Формат(ТекущаяДата(),"ДЛФ=Д") + ".xlsx";
		ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".xlsx";
		АдресНаСервере = СформироватьXLSXФайлНаКлиенте(ПолноеИмяФайла, ИмяВременногоФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьCSVФайлНаКлиенте(ПолноеИмяФайла, ИмяВременногоФайла)
	
	ПолноеИмяФайла = Каталог + "\" + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH.mm.ss'") + ".csv";
	ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".csv";  
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + ".csv";	
	КонецЕсли; 
	
	Попытка
		
		Кодировка = КодировкаТекста.Системная;
		ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка);
		
		СтрокаШапки = "C_SAN;IND;LIC;FAMIL;IMJA;OTCH;DROG;KOD_KLADR;FIAS;NYLIC;NDOM;LDOM;NKW;LKW;KSS;ROPL;Пл_МОП;KCHLS;KSOB;OKS;IN_DATE;OUT_DATE;TEL;V_DOK;S_DOK;N_DOK;D_DOK;KEM_V;ДокументыНаКвартиру;";
		
		ТекстовыйФайлЗапись.ЗаписатьСтроку(СтрокаШапки);
		
		Для каждого Строка Из ТаблицаИтог Цикл
			
			Разделитель = ";";
			ТекстовыйДокумент = "";
			
			ТекстовыйДокумент = 
			Строка.C_SAN + Разделитель + 
			Строка.IND + Разделитель + 
			Строка.LIC + Разделитель +	
			Строка.FAMIL + Разделитель +
			Строка.IMJA + Разделитель +
			Строка.OTCH + Разделитель +
			Строка.DROG + Разделитель +
			Строка.KOD_KLADR + Разделитель +
			Строка.FIAS + Разделитель +
			Строка.NYLIC + Разделитель +
			Строка.NDOM + Разделитель +
			Строка.LDOM + Разделитель +
			Строка.NKW + Разделитель +
			Строка.LKW + Разделитель +
			Строка.KSS + Разделитель +
			Строка.ROPL + Разделитель +
			Строка.Пл_МОП + Разделитель +
			Строка.KCHLS + Разделитель +
			Строка.KSOB + Разделитель +
			Строка.OKS + Разделитель +
			Строка.IN_DATE + Разделитель +
			Строка.OUT_DATE + Разделитель +
			Строка.TEL + Разделитель +
			Строка.V_DOK + Разделитель +
			Строка.S_DOK + Разделитель +
			Строка.N_DOK + Разделитель +
			Строка.D_DOK + Разделитель +
			Строка.KEM_V + Разделитель +
			Строка.ДокументыНаКвартиру + Разделитель;
			
			ТекстовыйФайлЗапись.ЗаписатьСтроку(ТекстовыйДокумент);
			
		КонецЦикла;
		
		ТекстовыйФайлЗапись.Закрыть();
		АдресНаСервере = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		
		ПолучитьФайл(АдресНаСервере, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

&НаКлиенте
Функция СформироватьDBFФайлНаКлиенте(ПолноеИмяФайла, ИмяВременногоФайла)
	
	ПолноеИмяФайла = Каталог + "\" + ИмяФайла + ".dbf";
	//ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".dbf";
	
	Попытка
		
		ФайлВыгрузки = Новый XBase();
		ФайлВыгрузки.Кодировка = КодировкаXBase.OEM;
		
		ФайлВыгрузки.Поля.Добавить("C_SAN", "S", 100);  
		ФайлВыгрузки.Поля.Добавить("IND", "S", 100);
		ФайлВыгрузки.Поля.Добавить("LIC"  , "S", 100);
		ФайлВыгрузки.Поля.Добавить("FAMIL"   ,"S", 100);
		ФайлВыгрузки.Поля.Добавить("IMJA"  , "S", 100);
		ФайлВыгрузки.Поля.Добавить("OTCH"  , "S", 100);
		ФайлВыгрузки.Поля.Добавить("DROG" , "S", 100);
		ФайлВыгрузки.Поля.Добавить("KOD_KLADR"   , "S", 100);	
		ФайлВыгрузки.Поля.Добавить("FIAS"  , "S", 100);
		ФайлВыгрузки.Поля.Добавить("NYLIC" , "S", 100);
		ФайлВыгрузки.Поля.Добавить("NDOM"  , "S", 100);
		ФайлВыгрузки.Поля.Добавить("LDOM"   , "S", 100);
		ФайлВыгрузки.Поля.Добавить("NKW" , "S", 100);
		ФайлВыгрузки.Поля.Добавить("LKW"    , "S", 100);
		ФайлВыгрузки.Поля.Добавить("KSS" , "S", 100);
		ФайлВыгрузки.Поля.Добавить("ROPL" , "S", 100);
		ФайлВыгрузки.Поля.Добавить("Pl_MOP", "S", 100);
		ФайлВыгрузки.Поля.Добавить("KCHLS", "S", 100);
		ФайлВыгрузки.Поля.Добавить("KSOB"  , "S", 100);
		ФайлВыгрузки.Поля.Добавить("OKS", "S", 100);
		ФайлВыгрузки.Поля.Добавить("IN_DATE"	, "S", 100);
		ФайлВыгрузки.Поля.Добавить("OUT_DATE", "S", 100);
		ФайлВыгрузки.Поля.Добавить("TEL","S", 100);
		ФайлВыгрузки.Поля.Добавить("V_DOK","S", 100);
		ФайлВыгрузки.Поля.Добавить("S_DOK","S", 100);
		ФайлВыгрузки.Поля.Добавить("N_DOK","S", 100);
		ФайлВыгрузки.Поля.Добавить("D_DOK","S", 100);
		ФайлВыгрузки.Поля.Добавить("KEM_V","S", 100);
		ФайлВыгрузки.Поля.Добавить("Dok_Na_Kv","S", 500);
		ФайлВыгрузки.Поля.Добавить("Dok_Na_Kv1","S", 500);
		ФайлВыгрузки.Поля.Добавить("Dok_Na_Kv2","S", 500);
		
		//ФайлВыгрузки.СоздатьФайл(ИмяВременногоФайла);
		ФайлВыгрузки.СоздатьФайл(ПолноеИмяФайла);
		
		ФайлВыгрузки.ОчиститьФайл();
		
		Для каждого Строка Из ТаблицаИтог Цикл
			
			ФайлВыгрузки.Добавить();
			
			ФайлВыгрузки.C_SAN = Строка.C_SAN;
			ФайлВыгрузки.IND = Строка.IND;
			ФайлВыгрузки.LIC = Строка.LIC;
			ФайлВыгрузки.FAMIL = Строка.FAMIL;
			ФайлВыгрузки.IMJA = Строка.IMJA;
			ФайлВыгрузки.OTCH = Строка.OTCH;
			ФайлВыгрузки.DROG = Строка.DROG;
			ФайлВыгрузки.KOD_KLADR = Строка.KOD_KLADR;
			ФайлВыгрузки.FIAS = Строка.FIAS;
			ФайлВыгрузки.NYLIC = Строка.NYLIC;
			ФайлВыгрузки.NDOM= Строка.NDOM;
			ФайлВыгрузки.LDOM = Строка.LDOM;
			ФайлВыгрузки.NKW = Строка.NKW;
			ФайлВыгрузки.LKW = Строка.LKW;
			ФайлВыгрузки.KSS = Строка.KSS;
			ФайлВыгрузки.ROPL= Строка.ROPL;
			ФайлВыгрузки.Pl_MOP = Строка.Пл_МОП;
			ФайлВыгрузки.KCHLS = Строка.KCHLS;
			ФайлВыгрузки.KSOB = Строка.KSOB;
			ФайлВыгрузки.OKS = Строка.OKS;
			ФайлВыгрузки.IN_DATE = Строка.IN_DATE;
			ФайлВыгрузки.OUT_DATE = Строка.OUT_DATE;
			ФайлВыгрузки.TEL = Строка.TEL;
			ФайлВыгрузки.V_DOK = Строка.V_DOK;
			ФайлВыгрузки.S_DOK= Строка.S_DOK;
			ФайлВыгрузки.N_DOK = Строка.N_DOK;
			ФайлВыгрузки.D_DOK = Строка.D_DOK;
			ФайлВыгрузки.KEM_V = Строка.KEM_V;
			
			
			Если СтрДлина(Строка.ДокументыНаКвартиру) > 244 Тогда
				ФайлВыгрузки.Dok_Na_Kv = Лев(Строка.ДокументыНаКвартиру, 244);
				нСтрока = Прав(Строка.ДокументыНаКвартиру,  СтрДлина(Строка.ДокументыНаКвартиру) - 244);
				Если СтрДлина(нСтрока) > 244 Тогда
					ФайлВыгрузки.Dok_Na_Kv1 = Лев(нСтрока, 244);
					ннСтрока = Прав(нСтрока,  СтрДлина(нСтрока) - 244);
					ФайлВыгрузки.Dok_Na_Kv2 = ннСтрока;	
				Иначе
					ФайлВыгрузки.Dok_Na_Kv1 = нСтрока;
				КонецЕсли;
			Иначе
				ФайлВыгрузки.Dok_Na_Kv = Строка.ДокументыНаКвартиру;
			КонецЕсли;
			
			ФайлВыгрузки.Записать();
			
		КонецЦикла;
		
		//АдресНаСервере = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		//
		//ПолучитьФайл(АдресНаСервере, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
		//Если ФайлВыгрузки.Открыта() Тогда
		//	ФайлВыгрузки.ЗакрытьФайл();
		//КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка создания файла. " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция СформироватьXLSXФайлНаКлиенте(ПолноеИмяФайла, ИмяВременногоФайла)
	
	СформироватьXLSXФайлНаСервере(ПолноеИмяФайла, ИмяВременногоФайла);
	
	Попытка
		
		ПолучитьФайл(АдресВоВременномХранилище, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

&НаСервере
Функция СформироватьXLSXФайлНаСервере(ПолноеИмяФайла, ИмяВременногоФайла)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапка);
	Для каждого стр Из ТаблицаИтог Цикл
		
		ОбластьДетальныхЗаписей.Параметры.Заполнить(стр);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		
	КонецЦикла;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ЧастиИмени(ФамилияИмяОтчество)
	
	Результат = Новый Структура("Фамилия,Имя,Отчество");
	
	ЧастиИмени = СтрРазделить(ФамилияИмяОтчество, " ", Ложь);
	
	Если ЧастиИмени.Количество() >= 1 Тогда
		Результат.Фамилия = ЧастиИмени[0];
	КонецЕсли;
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		Результат.Имя = ЧастиИмени[1];
	КонецЕсли;
	
	Если ЧастиИмени.Количество() >= 3 Тогда
		Результат.Отчество = ЧастиИмени[2];
	КонецЕсли;
	
	Если ЧастиИмени.Количество() > 3 Тогда
		ДополнительныеЧастиОтчества = Новый Массив;
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'оглы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'улы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'уулу'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'кызы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'гызы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'угли'"));
		
		Если ДополнительныеЧастиОтчества.Найти(НРег(ЧастиИмени[3])) <> Неопределено Тогда
			Результат.Отчество = Результат.Отчество + " " + ЧастиИмени[3];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьФамилияИмяОтчество(Знач ФамилияИмяОтчество) 
	
	Если ТипЗнч(ФамилияИмяОтчество) = Тип("Строка") Тогда
		ФамилияИмяОтчество = ЧастиИмени(ФамилияИмяОтчество);
	КонецЕсли;
	
	Фамилия = ФамилияИмяОтчество.Фамилия;
	Имя = ФамилияИмяОтчество.Имя;
	Отчество = ФамилияИмяОтчество.Отчество;
	
	Если ПустаяСтрока(Имя) Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Если ПустаяСтрока(Отчество) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2.", Фамилия, Лев(Имя, 1));
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2. %3.", Фамилия, Лев(Имя, 1), Лев(Отчество, 1));
	
КонецФункции

&НаСервере
Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресов()
	
	МассивАдресов = Новый Массив;
	
	МассивАдресов = Адреса.Выгрузить(,"Адрес").ВыгрузитьКолонку("Адрес");
	
	Возврат МассивАдресов;
	
КонецФункции

&НаСервере
Функция СтрокаВДату(Знач ДатаСтрока) Экспорт
	
	ПозицияПробела = СтрНайти(ДатаСтрока, " ", НаправлениеПоиска.СНачала);
	Если ПозицияПробела > 0 Тогда
		ДатаСтрока = Лев(ДатаСтрока, ПозицияПробела - 1);
	КонецЕсли;
	ДатаСтрока = СокрЛП(СтрЗаменить(ДатаСтрока, ".", ""));
	ДатаСтрока = Сред(ДатаСтрока, 5) + Сред(ДатаСтрока, 3, 2) + Лев(ДатаСтрока, 2);
	Если СтрДлина(ДатаСтрока) = 6 Тогда
		ДатаСтрока = "20" + ДатаСтрока;
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат    = ОписаниеТипа.ПривестиЗначение(ДатаСтрока);
	
	Возврат Результат;
	
КонецФункции
